case文件/constant/DISKProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          DiskProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//Gauss distribution parameters
epsilon 0.04;  //here we input the 

//Turbine Properties
T2    0.8;
TSR   1.9;
U_inf 1; 
bladeNum 3;
point_of_each_line 40;
bladeDiameter  1;
turbineCenter_x 1.52;
turbineCenter_y 1.83;
turbineCenter_z 1.22;
turbineCenter (1.52 1.83 1.22);
sphereRadius 2;
height 1;
chord 0.14;
initialPhase 0;
testRe 100000;

//Axial Properties
TowingDirection (1 0 0);
TowingVelocity 1;
Naxial  (-1 0 0) ;
ShaftNaxial (0 0 1);

	
rho  1000;
nu 1.308e-6;

//AirfoilTable
//(
//(-180	-170	-160	-150	-140	-130	-120	-110	-100	-90	-80	-70	-60	-50	-40	-30	-20	-10.5	-10.25	-10	-9.75	-9.5	-9.25	-9	-8.75	-8.5	-8.25	-8	-7.75	-7.5	-7.25	-7	-6.75	-6.5	-6.25	-6	-5.75	-5.5	-5.25	-5	-4.75	-4.5	-4.25	-4	-3.75	-3.5	-3.25	-3	-2.75	-2.5	-2.25	-2	-1.75	-1.5	-1.25	-1	-0.75	-0.5	-0.25	0	0.25	0.5	0.75	1	1.25	1.5	1.75	2	2.25	2.5	2.75	3	3.25	3.5	3.75	4	4.25	4.5	4.75	5	5.25	5.5	5.75	6	6.25	6.5	6.75	7	7.25	7.5	7.75	8	8.25	8.5	8.75	9	9.25	9.5	9.75	10.25	10.5	20	30	40	50	60	70	80	90	100	110	120	130	140	150	160	170	180)
//(0.0000	0.2085	0.3180	0.4072	0.4545	0.4504	0.3941	0.2916	0.1548 0.0000	-0.1548	-0.2916	-0.3941	-0.4504	-0.4545	-0.4072	-0.3180	-0.2189	-0.2843	-0.3247	-0.2690	-0.2967	-0.2590	-0.2672	-0.3659	-0.3767	-0.4033	-0.4715	-0.4041	-0.4468	-0.6906	-0.8363	-0.7209	-0.8240	-0.7822	-0.8189	-0.7958	-0.8154	-0.7909	-0.8085	-0.7788	-0.7837	-0.7645	-0.7592	-0.7521	-0.7355	-0.7304	-0.6987	-0.6416	-0.5915	-0.5503	-0.5136	-0.4532	-0.3880	-0.3540	-0.3318	-0.2325	-0.1461	-0.1393	0.0000	0.1392	0.1463	0.2325	0.3317	0.3539	0.3878	0.4531	0.5135	0.5504	0.5915	0.6416	0.6987	0.7301	0.7353	0.7520	0.7589	0.7643	0.7834	0.7786	0.8081	0.7906	0.8155	0.7955	0.8190	0.7819	0.8243	0.7216	0.6677	0.6916	0.4474	0.4049	0.4721	0.4039	0.3775	0.3673	0.3997	0.3819	0.3752	0.3820	0.2855	0.3127	0.4543	0.5816	0.6492	0.6435	0.5630	0.4165	0.2211	0.0000	-0.1548	-0.2916	-0.3941	-0.4504	-0.4545	-0.4072	-0.3180	-0.2085	0.0000)
//(0.0842	0.1218	0.2300	0.3954	0.5975	0.8111	1.0096	1.1679	1.2657	1.2900	1.2657	1.1679	1.0096	0.8111	0.5975	0.3954	0.2300	0.1256	0.1222	0.1228	0.1168	0.1167	0.1117	0.1107	0.0940	0.0902	0.0853	0.0775	0.0804	0.0752	0.0580	0.0492	0.0545	0.0478	0.0491	0.0460	0.0463	0.0440	0.0446	0.0422	0.0433	0.0417	0.0421	0.0414	0.0408	0.0411	0.0403	0.0409	0.0422	0.0430	0.0434	0.0437	0.0453	0.0465	0.0467	0.0467	0.0488	0.0494	0.0493	0.0504	0.0493	0.0494	0.0488	0.0467	0.0467	0.0465	0.0453	0.0437	0.0434	0.0430	0.0421	0.0409	0.0403	0.0411	0.0408	0.0414	0.0421	0.0417	0.0433	0.0422	0.0446	0.0440	0.0463	0.0459	0.0491	0.0477	0.0544	0.0581	0.0579	0.0751	0.0803	0.0774	0.0853	0.0902	0.0939	0.0945	0.0994	0.1039	0.1080	0.1221	0.1256	0.2300	0.3954	0.5975	0.8111	1.0096	1.1679	1.2657	1.2900	1.2657	1.1679	1.0096	0.8111	0.5975	0.3954	0.2300	0.1218	0.0842)
//);

AirfoilTable
(
(-180	-175	-170	-165	-160	-155	-150	-145	-140	-135	-130	-125	-120	-115	-110	-105	-100	-95	-90	-85	-80	-75	-70	-65	-60	-55	-50	-45	-40	-35	-30	-25	-22	-20	-18	-16	-14	-13	-12	-11	-10	-9	-8	-7	-6	-5	-4	-3	-2	-1	0	1	2	3	4	5	6	7	8	9	10	11	12	13	14	16	18	20	22	25	30	35	40	45	50	55	60	65	70	75	80	85	90	95	100	105	110	115	120	125	130	135	140	145	150	155	160	165	170	175	180)

(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-0.6664	-0.6023	-0.592	-0.6098	-0.6487	-0.6993	-0.7255	-0.7363	-0.7443	-0.7374	-0.7148	-0.6745	-0.6209	-0.5486	-0.4687	-0.38	-0.2861	-0.1879	-0.0842	0	0.0842	0.1879	0.2861	0.38	0.4687	0.5486	0.6209	0.6745	0.7148	0.7374	0.7443	0.7363	0.7255	0.6993	0.6487	0.6098	0.592	0.6023	0.6664	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)

(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.282	0.238	0.196	0.158	0.086	0.0292	0.0266	0.0243	0.0222	0.0204	0.0187	0.0174	0.0163	0.0155	0.0148	0.0143	0.014	0.0139	0.014	0.0143	0.0148	0.0155	0.0163	0.0174	0.0187	0.0204	0.0222	0.0243	0.0266	0.0292	0.086	0.158	0.196	0.238	0.282	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
);







globalProperties
{
    outputControl       "timeStep";
    //outputControl       "runTime";
    outputInterval       1;
}

// ************************************************************************* //
