case文件/constant/foilData
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          foilData;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Re_list (50000 100000 200000 500000 1000000);


attack_list (-180	-170	-160	-150	-140	-130	-120	-110	-100	-90	-80	-70	-60	-50	-40	-30	-20	-19.75	-19.5	-19.25	-19	-18.75	-18.5	-18.25	-18	-17.75	-17.5	-17.25	-17	-16.75	-16.5	-16.25	-16	-15.75	-15.5	-15.25	-15	-14.75	-14.5	-14.25	-14	-13.75	-13.5	-13.25	-13	-12.75	-12.5	-12.25	-12	-11.75	-11.5	-11.25	-11	-10.75	-10.5	-10.25	-10	-9.75	-9.5	-9.25	-9	-8.75	-8.5	-8.25	-8	-7.75	-7.5	-7.25	-7	-6.75	-6.5	-6.25	-6	-5.75	-5.5	-5.25	-5	-4.75	-4.5	-4.25	-4	-3.75	-3.5	-3.25	-2.75	-2.5	-2.25	-2	-1.75	-1.5	-1.25	-1	-0.75	-0.5	-0.25	0	0.25	0.5	0.75	1	1.25	1.5	1.75	2	2.25	2.5	2.75	3.25	3.5	3.75	4	4.25	4.5	4.75	5	5.25	5.5	5.75	6	6.25	6.5	6.75	7	7.25	7.5	7.75	8	8.25	8.5	8.75	9	9.25	9.5	9.75	10	10.25	10.5	10.75	11	11.25	11.5	11.75	12	12.25	12.5	12.75	13	13.25	13.5	13.75	14	14.25	14.5	14.75	15	15.25	15.5	15.75	16	16.25	16.5	16.75	17	17.25	17.5	17.75	18	18.25	18.5	18.75	19	19.25	20	30	40	50	60	70	80	90	100	110	120	130	140	150	160	170	180);



mutiRe_Cd
(
(0.0800	0.1177	0.2261	0.3918	0.5943	0.8085	1.0075	1.1665	1.2650	1.2900	1.2650	1.1665	1.0075	0.8085	0.5943	0.3918	0.2261	0.2229	0.2197	0.2165	0.2133	0.2100	0.2068	0.2036	0.2004	0.1972	0.1940	0.1907	0.1875	0.1843	0.1811	0.1779	0.1750	0.1721	0.1355	0.0988	0.0622	0.0566	0.0523	0.0520	0.0503	0.0477	0.0452	0.0448	0.0434	0.0418	0.0406	0.0399	0.0389	0.0378	0.0372	0.0364	0.0355	0.0349	0.0342	0.0334	0.0329	0.0323	0.0316	0.0312	0.0305	0.0301	0.0296	0.0291	0.0287	0.0283	0.0280	0.0276	0.0274	0.0270	0.0268	0.0267	0.0265	0.0266	0.0264	0.0262	0.0261	0.0260	0.0258	0.0256	0.0255	0.0253	0.0250	0.0249	0.0243	0.0241	0.0237	0.0235	0.0231	0.0231	0.0226	0.0225	0.0225	0.0223	0.0224	0.0222	0.0224	0.0223	0.0225	0.0225	0.0226	0.0231	0.0231	0.0235	0.0237	0.0241	0.0243	0.0249	0.0250	0.0253	0.0255	0.0256	0.0258	0.0260	0.0261	0.0262	0.0264	0.0266	0.0265	0.0267	0.0268	0.0270	0.0273	0.0275	0.0280	0.0283	0.0287	0.0291	0.0296	0.0301	0.0305	0.0312	0.0316	0.0323	0.0329	0.0334	0.0342	0.0349	0.0355	0.0364	0.0372	0.0378	0.0389	0.0399	0.0406	0.0418	0.0434	0.0448	0.0452	0.0477	0.0503	0.0519	0.0523	0.0566	0.0622	0.1665	0.1696	0.1728	0.1759	0.1790	0.1822	0.1853	0.1885	0.1916	0.1947	0.1979	0.2010	0.2041	0.2073	0.2104	0.2136	0.2167	0.2261	0.3918	0.5943	0.8085	1.0075	1.1665	1.2650	1.2900	1.2650	1.1665	1.0075	0.8085	0.5943	0.3918	0.2261	0.1177	0.0800)
(0.0800	0.1177	0.2261	0.3918	0.5943	0.8085	1.0075	1.1665	1.2650	1.2900	1.2650	1.1665	1.0075	0.8085	0.5943	0.3918	0.2261	0.2229	0.2197	0.2165	0.2133	0.2100	0.2068	0.2036	0.2004	0.1972	0.1940	0.1907	0.1875	0.1843	0.1811	0.1779	0.1750	0.1721	0.1355	0.0988	0.0622	0.0566	0.0523	0.0520	0.0503	0.0477	0.0452	0.0448	0.0434	0.0418	0.0406	0.0399	0.0389	0.0378	0.0372	0.0364	0.0355	0.0349	0.0342	0.0334	0.0329	0.0323	0.0316	0.0312	0.0305	0.0301	0.0296	0.0291	0.0287	0.0283	0.0280	0.0276	0.0274	0.0270	0.0268	0.0267	0.0265	0.0266	0.0264	0.0262	0.0261	0.0260	0.0258	0.0256	0.0255	0.0253	0.0250	0.0249	0.0243	0.0241	0.0237	0.0235	0.0231	0.0231	0.0226	0.0225	0.0225	0.0223	0.0224	0.0222	0.0224	0.0223	0.0225	0.0225	0.0226	0.0231	0.0231	0.0235	0.0237	0.0241	0.0243	0.0249	0.0250	0.0253	0.0255	0.0256	0.0258	0.0260	0.0261	0.0262	0.0264	0.0266	0.0265	0.0267	0.0268	0.0270	0.0273	0.0275	0.0280	0.0283	0.0287	0.0291	0.0296	0.0301	0.0305	0.0312	0.0316	0.0323	0.0329	0.0334	0.0342	0.0349	0.0355	0.0364	0.0372	0.0378	0.0389	0.0399	0.0406	0.0418	0.0434	0.0448	0.0452	0.0477	0.0503	0.0519	0.0523	0.0566	0.0622	0.1665	0.1696	0.1728	0.1759	0.1790	0.1822	0.1853	0.1885	0.1916	0.1947	0.1979	0.2010	0.2041	0.2073	0.2104	0.2136	0.2167	0.2261	0.3918	0.5943	0.8085	1.0075	1.1665	1.2650	1.2900	1.2650	1.1665	1.0075	0.8085	0.5943	0.3918	0.2261	0.1177	0.0800)
(0.0100	0.0100	0.0954	0.2713	0.4877	0.7190	0.9380	1.1189	1.2408	1.2900	1.2408	1.1189	0.9380	0.7190	0.4877	0.2713	0.0954	0.0917	0.0880	0.0844	0.0783	0.0785	0.0765	0.0732	0.0691	0.0649	0.0643	0.0622	0.0593	0.0559	0.0546	0.0529	0.0506	0.0480	0.0467	0.0451	0.0432	0.0413	0.0401	0.0386	0.0370	0.0358	0.0346	0.0333	0.0322	0.0311	0.0301	0.0292	0.0283	0.0275	0.0267	0.0261	0.0256	0.0250	0.0245	0.0242	0.0239	0.0236	0.0233	0.0231	0.0227	0.0224	0.0219	0.0216	0.0211	0.0208	0.0204	0.0199	0.0196	0.0192	0.0188	0.0185	0.0181	0.0177	0.0173	0.0170	0.0166	0.0163	0.0160	0.0157	0.0154	0.0152	0.0149	0.0147	0.0143	0.0141	0.0140	0.0139	0.0138	0.0137	0.0136	0.0135	0.0135	0.0135	0.0134	0.0134	0.0134	0.0135	0.0135	0.0135	0.0136	0.0137	0.0138	0.0139	0.0140	0.0141	0.0143	0.0147	0.0149	0.0152	0.0154	0.0157	0.0160	0.0163	0.0166	0.0170	0.0173	0.0177	0.0181	0.0185	0.0188	0.0192	0.0196	0.0199	0.0204	0.0207	0.0211	0.0216	0.0219	0.0224	0.0226	0.0231	0.0233	0.0235	0.0239	0.0242	0.0245	0.0250	0.0255	0.0261	0.0267	0.0275	0.0283	0.0291	0.0301	0.0311	0.0322	0.0333	0.0346	0.0358	0.0370	0.0386	0.0401	0.0412	0.0432	0.0451	0.0467	0.0480	0.0506	0.0528	0.0545	0.0559	0.0593	0.0621	0.0642	0.0646	0.0691	0.0731	0.0764	0.0784	0.0784	0.0844	0.0954	0.2713	0.4877	0.7190	0.9380	1.1189	1.2408	1.2900	1.2408	1.1189	0.9380	0.7190	0.4877	0.2713	0.0954	0.0100	0.0100)
(0.0100	0.0100	0.0958	0.2718	0.4881	0.7193	0.9382	1.1191	1.2409	1.2900	1.2409	1.1191	0.9382	0.7193	0.4881	0.2718	0.0958	0.0922	0.0885	0.0849	0.0816	0.0780	0.0744	0.0711	0.0681	0.0649	0.0615	0.0584	0.0557	0.0532	0.0502	0.0475	0.0452	0.0431	0.0408	0.0385	0.0367	0.0352	0.0332	0.0315	0.0302	0.0289	0.0274	0.0262	0.0254	0.0241	0.0232	0.0225	0.0215	0.0209	0.0204	0.0198	0.0193	0.0190	0.0187	0.0181	0.0176	0.0171	0.0166	0.0161	0.0156	0.0152	0.0147	0.0144	0.0139	0.0135	0.0131	0.0128	0.0125	0.0123	0.0120	0.0118	0.0115	0.0113	0.0111	0.0109	0.0108	0.0106	0.0105	0.0103	0.0102	0.0101	0.0100	0.0099	0.0098	0.0097	0.0097	0.0096	0.0096	0.0095	0.0095	0.0095	0.0095	0.0094	0.0094	0.0094	0.0094	0.0094	0.0095	0.0095	0.0095	0.0095	0.0096	0.0096	0.0097	0.0097	0.0098	0.0099	0.0100	0.0101	0.0102	0.0103	0.0105	0.0106	0.0108	0.0109	0.0111	0.0113	0.0115	0.0118	0.0120	0.0123	0.0125	0.0128	0.0131	0.0135	0.0139	0.0144	0.0147	0.0152	0.0156	0.0161	0.0166	0.0170	0.0176	0.0181	0.0187	0.0190	0.0193	0.0197	0.0204	0.0208	0.0215	0.0225	0.0232	0.0241	0.0253	0.0262	0.0274	0.0289	0.0301	0.0315	0.0332	0.0351	0.0366	0.0385	0.0408	0.0431	0.0451	0.0474	0.0502	0.0531	0.0556	0.0583	0.0614	0.0649	0.0679	0.0710	0.0743	0.0779	0.0815	0.0849	0.0958	0.2718	0.4881	0.7193	0.9382	1.1191	1.2409	1.2900	1.2409	1.1191	0.9382	0.7193	0.4881	0.2718	0.0958	0.0100	0.0100)
(0.0100	0.0100	0.0811	0.2582	0.4761	0.7093	0.9304	1.1137	1.2382	1.2900	1.2382	1.1137	0.9304	0.7093	0.4761	0.2582	0.0811	0.0774	0.0737	0.0701	0.0667	0.0636	0.0596	0.0561	0.0530	0.0502	0.0477	0.0449	0.0423	0.0400	0.0380	0.0362	0.0341	0.0323	0.0308	0.0294	0.0278	0.0265	0.0255	0.0243	0.0232	0.0223	0.0215	0.0206	0.0198	0.0192	0.0185	0.0180	0.0175	0.0172	0.0166	0.0161	0.0156	0.0151	0.0146	0.0142	0.0137	0.0133	0.0128	0.0125	0.0121	0.0119	0.0115	0.0113	0.0111	0.0108	0.0106	0.0104	0.0102	0.0100	0.0098	0.0097	0.0095	0.0094	0.0092	0.0091	0.0090	0.0089	0.0087	0.0087	0.0086	0.0085	0.0084	0.0084	0.0082	0.0082	0.0081	0.0081	0.0081	0.0080	0.0080	0.0080	0.0080	0.0079	0.0079	0.0080	0.0079	0.0079	0.0080	0.0080	0.0080	0.0080	0.0081	0.0081	0.0081	0.0082	0.0082	0.0084	0.0084	0.0085	0.0086	0.0087	0.0087	0.0089	0.0090	0.0091	0.0092	0.0094	0.0095	0.0097	0.0098	0.0100	0.0102	0.0104	0.0106	0.0108	0.0111	0.0113	0.0115	0.0119	0.0121	0.0125	0.0128	0.0133	0.0137	0.0142	0.0146	0.0151	0.0156	0.0161	0.0166	0.0172	0.0175	0.0179	0.0185	0.0192	0.0198	0.0205	0.0215	0.0222	0.0232	0.0243	0.0254	0.0265	0.0278	0.0294	0.0307	0.0322	0.0340	0.0362	0.0379	0.0399	0.0422	0.0448	0.0476	0.0500	0.0528	0.0560	0.0595	0.0634	0.0665	0.0701	0.0811	0.2582	0.4761	0.7093	0.9304	1.1137	1.2382	1.2900	1.2382	1.1137	0.9304	0.7093	0.4761	0.2582	0.0811	0.0100	0.0100)
);



mutiRe_Cl
(
(0.0000	0.2468	0.3976	0.4534	0.4826	0.4671	0.4030	0.2954	0.1557	0.0000	-0.1557	-0.2954	-0.4030	-0.4671	-0.4826	-0.4534	-0.3976	-0.3964	-0.3952	-0.3940	-0.3928	-0.3916	-0.3904	-0.3892	-0.3880	-0.3868	-0.3856	-0.3844	-0.3832	-0.3820	-0.3808	-0.3796	-0.3787	-0.3778	-0.6091	-0.8403	-1.0716	-1.1181	-1.1584	-1.1225	-1.1217	-1.1410	-1.1689	-1.1295	-1.1311	-1.1495	-1.1393	-1.1243	-1.1374	-1.1599	-1.1248	-1.1280	-1.1446	-1.1160	-1.1166	-1.1202	-1.1022	-1.1033	-1.0943	-1.0843	-1.0869	-1.0682	-1.0638	-1.0510	-1.0410	-1.0310	-1.0177	-1.0080	-0.9930	-0.9825	-0.9668	-0.9284	-0.8880	-0.8396	-0.8021	-0.7628	-0.7209	-0.6844	-0.6395	-0.6102	-0.5600	-0.5318	-0.4845	-0.4524	-0.3715	-0.3309	-0.2802	-0.2618	-0.2139	-0.1906	-0.1507	-0.1207	-0.0906	-0.0653	-0.0304	0.0000	0.0304	0.0653	0.0906	0.1207	0.1507	0.1906	0.2139	0.2618	0.2802	0.3309	0.3713	0.4523	0.4844	0.5316	0.5600	0.6101	0.6395	0.6843	0.7209	0.7627	0.8021	0.8394	0.8879	0.9285	0.9665	0.9822	0.9927	1.0077	1.0174	1.0308	1.0408	1.0508	1.0636	1.0680	1.0866	1.0841	1.0941	1.1032	1.1020	1.1200	1.1165	1.1160	1.1445	1.1281	1.1251	1.1600	1.1377	1.1248	1.1405	1.1499	1.1318	1.1308	1.1694	1.1418	1.1230	1.1250	1.1589	1.1189	1.0729	0.5376	0.5392	0.5408	0.5424	0.5440	0.5456	0.5472	0.5488	0.5504	0.5520	0.5536	0.5552	0.5568	0.5584	0.5600	0.5616	0.5632	0.5680	0.6477	0.6894	0.6672	0.5757	0.4220	0.2224	0.0000	-0.1557	-0.2954	-0.4030	-0.4671	-0.4826	-0.4534	-0.3976	-0.2468	0.0000)
(0.0000	0.2468	0.3976	0.4534	0.4826	0.4671	0.4030	0.2954	0.1557	0.0000	-0.1557	-0.2954	-0.4030	-0.4671	-0.4826	-0.4534	-0.3976	-0.3964	-0.3952	-0.3940	-0.3928	-0.3916	-0.3904	-0.3892	-0.3880	-0.3868	-0.3856	-0.3844	-0.3832	-0.3820	-0.3808	-0.3796	-0.3787	-0.3778	-0.6091	-0.8403	-1.0716	-1.1181	-1.1584	-1.1225	-1.1217	-1.1410	-1.1689	-1.1295	-1.1311	-1.1495	-1.1393	-1.1243	-1.1374	-1.1599	-1.1248	-1.1280	-1.1446	-1.1160	-1.1166	-1.1202	-1.1022	-1.1033	-1.0943	-1.0843	-1.0869	-1.0682	-1.0638	-1.0510	-1.0410	-1.0310	-1.0177	-1.0080	-0.9930	-0.9825	-0.9668	-0.9284	-0.8880	-0.8396	-0.8021	-0.7628	-0.7209	-0.6844	-0.6395	-0.6102	-0.5600	-0.5318	-0.4845	-0.4524	-0.3715	-0.3309	-0.2802	-0.2618	-0.2139	-0.1906	-0.1507	-0.1207	-0.0906	-0.0653	-0.0304	0.0000	0.0304	0.0653	0.0906	0.1207	0.1507	0.1906	0.2139	0.2618	0.2802	0.3309	0.3713	0.4523	0.4844	0.5316	0.5600	0.6101	0.6395	0.6843	0.7209	0.7627	0.8021	0.8394	0.8879	0.9285	0.9665	0.9822	0.9927	1.0077	1.0174	1.0308	1.0408	1.0508	1.0636	1.0680	1.0866	1.0841	1.0941	1.1032	1.1020	1.1200	1.1165	1.1160	1.1445	1.1281	1.1251	1.1600	1.1377	1.1248	1.1405	1.1499	1.1318	1.1308	1.1694	1.1418	1.1230	1.1250	1.1589	1.1189	1.0729	0.5376	0.5392	0.5408	0.5424	0.5440	0.5456	0.5472	0.5488	0.5504	0.5520	0.5536	0.5552	0.5568	0.5584	0.5600	0.5616	0.5632	0.5680	0.6477	0.6894	0.6672	0.5757	0.4220	0.2224	0.0000	-0.1557	-0.2954	-0.4030	-0.4671	-0.4826	-0.4534	-0.3976	-0.2468	0.0000)
(0.0000	0.4388	0.8285	0.7037	0.6350	0.5571	0.4512	0.3162	0.1608	0.0000	-0.1608	-0.3162	-0.4512	-0.5571	-0.6350	-0.7037	-0.8285	-0.8338	-0.8391	-0.8447	-1.2278	-1.2032	-1.1961	-1.1992	-1.2090	-1.2212	-1.2022	-1.1971	-1.1989	-1.2067	-1.1937	-1.1864	-1.1842	-1.1871	-1.1747	-1.1677	-1.1645	-1.1623	-1.1497	-1.1433	-1.1397	-1.1282	-1.1203	-1.1145	-1.1045	-1.0959	-1.0895	-1.0801	-1.0725	-1.0675	-1.0603	-1.0561	-1.0548	-1.0521	-1.0534	-1.0585	-1.0652	-1.0728	-1.0784	-1.0798	-1.0772	-1.0743	-1.0406	-1.0014	-0.9676	-0.9285	-0.8926	-0.8568	-0.8148	-0.7844	-0.7448	-0.7005	-0.6726	-0.6312	-0.5890	-0.5649	-0.5284	-0.5013	-0.4704	-0.4429	-0.4151	-0.3892	-0.3617	-0.3370	-0.2848	-0.2571	-0.2326	-0.2073	-0.1801	-0.1557	-0.1288	-0.1032	-0.0783	-0.0524	-0.0264	0.0000	0.0264	0.0524	0.0783	0.1032	0.1288	0.1557	0.1801	0.2073	0.2326	0.2571	0.2848	0.3371	0.3617	0.3893	0.4151	0.4429	0.4704	0.5013	0.5284	0.5649	0.5891	0.6313	0.6726	0.7006	0.7449	0.7845	0.8149	0.8569	0.8926	0.9287	0.9678	1.0017	1.0409	1.0741	1.0770	1.0797	1.0783	1.0729	1.0653	1.0586	1.0536	1.0524	1.0551	1.0565	1.0607	1.0680	1.0731	1.0810	1.0904	1.0969	1.1057	1.1157	1.1216	1.1297	1.1411	1.1448	1.1515	1.1647	1.1663	1.1697	1.1770	1.1888	1.1862	1.1888	1.1965	1.2085	1.2012	1.1998	1.2054	1.2264	1.2113	1.2021	1.1994	1.2073	1.2296	1.2067	1.1835	1.0053	0.9071	0.7958	0.6446	0.4517	0.2297	0.0000	-0.1608	-0.3162	-0.4512	-0.5571	-0.6350	-0.7037	-0.8285	-0.4388	0.0000)
(0.0000	0.4480	0.8454	0.7136	0.6410	0.5606	0.4531	0.3170	0.1610	0.0000	-0.1610	-0.3170	-0.4531	-0.5606	-0.6410	-0.7136	-0.8454	-0.8509	-0.8565	-0.8624	-1.2301	-1.2347	-1.2386	-1.2399	-1.2400	-1.2408	-1.2455	-1.2466	-1.2451	-1.2412	-1.2432	-1.2435	-1.2401	-1.2336	-1.2310	-1.2290	-1.2228	-1.2129	-1.2091	-1.2032	-1.1933	-1.1831	-1.1771	-1.1671	-1.1535	-1.1475	-1.1375	-1.1246	-1.1200	-1.1136	-1.1058	-1.1078	-1.1107	-1.1141	-1.1224	-1.0934	-1.0611	-1.0285	-0.9983	-0.9668	-0.9330	-0.8959	-0.8643	-0.8319	-0.8001	-0.7692	-0.7466	-0.7182	-0.6987	-0.6738	-0.6532	-0.6292	-0.6071	-0.5831	-0.5596	-0.5355	-0.5109	-0.4866	-0.4615	-0.4368	-0.4113	-0.3865	-0.3605	-0.3357	-0.2845	-0.2583	-0.2331	-0.2069	-0.1814	-0.1554	-0.1295	-0.1040	-0.0774	-0.0521	-0.0258	0.0000	0.0258	0.0521	0.0774	0.1040	0.1295	0.1555	0.1815	0.2069	0.2331	0.2583	0.2845	0.3357	0.3606	0.3866	0.4114	0.4369	0.4616	0.4867	0.5110	0.5356	0.5598	0.5833	0.6073	0.6294	0.6535	0.6741	0.6990	0.7185	0.7469	0.7695	0.8005	0.8323	0.8646	0.8964	0.9335	0.9673	0.9988	1.0292	1.0618	1.0941	1.1224	1.1141	1.1108	1.1079	1.1062	1.1141	1.1207	1.1256	1.1386	1.1487	1.1550	1.1687	1.1787	1.1847	1.1953	1.2052	1.2111	1.2153	1.2252	1.2315	1.2333	1.2364	1.2429	1.2463	1.2460	1.2446	1.2484	1.2499	1.2487	1.2439	1.2436	1.2437	1.2422	1.2382	1.2338	1.2320	1.2077	1.0194	0.9156	0.8009	0.6473	0.4528	0.2300	0.0000	-0.1610	-0.3170	-0.4531	-0.5606	-0.6410	-0.7136	-0.8454	-0.4480	0.0000)
(0.0000	0.4957	0.9330	0.7645	0.6719	0.5789	0.4629	0.3212	0.1620	0.0000	-0.1620	-0.3212	-0.4629	-0.5789	-0.6719	-0.7645	-0.9330	-0.9399	-0.9469	-0.9542	-1.3630	-1.3640	-1.3727	-1.3785	-1.3809	-1.3805	-1.3775	-1.3782	-1.3782	-1.3750	-1.3687	-1.3613	-1.3583	-1.3521	-1.3428	-1.3326	-1.3257	-1.3161	-1.3036	-1.2929	-1.2826	-1.2700	-1.2556	-1.2456	-1.2336	-1.2204	-1.2131	-1.2076	-1.2041	-1.2064	-1.1882	-1.1585	-1.1294	-1.0982	-1.0669	-1.0385	-1.0087	-0.9774	-0.9478	-0.9247	-0.9015	-0.8817	-0.8619	-0.8432	-0.8229	-0.8009	-0.7780	-0.7551	-0.7311	-0.7074	-0.6827	-0.6583	-0.6331	-0.6081	-0.5827	-0.5571	-0.5317	-0.5056	-0.4799	-0.4538	-0.4278	-0.4013	-0.3754	-0.3483	-0.2959	-0.2691	-0.2421	-0.2155	-0.1886	-0.1618	-0.1347	-0.1080	-0.0808	-0.0539	-0.0269	0.0000	0.0269	0.0539	0.0808	0.1080	0.1347	0.1618	0.1886	0.2155	0.2421	0.2692	0.2960	0.3483	0.3754	0.4014	0.4279	0.4539	0.4800	0.5058	0.5318	0.5573	0.5829	0.6083	0.6333	0.6585	0.6829	0.7076	0.7314	0.7554	0.7784	0.8013	0.8233	0.8438	0.8625	0.8823	0.9021	0.9253	0.9483	0.9780	1.0093	1.0390	1.0676	1.0990	1.1302	1.1594	1.1891	1.2063	1.2043	1.2080	1.2137	1.2213	1.2347	1.2468	1.2570	1.2716	1.2842	1.2946	1.3057	1.3182	1.3279	1.3347	1.3454	1.3546	1.3609	1.3639	1.3719	1.3781	1.3814	1.3813	1.3813	1.3843	1.3848	1.3824	1.3766	1.3688	1.3675	1.3631	1.3329	1.0921	0.9599	0.8270	0.6613	0.4589	0.2315	0.0000	-0.1620	-0.3212	-0.4629	-0.5789	-0.6719	-0.7645	-0.9330	-0.4957	0.0000)

);



// ************************************************************************* //
