case文件/constant/foilData.NHU
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          foilData;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Re_list (40000 80000 160000 360000 700000 1000000 2000000 5000000);


attack_list (-180	-175	-170	-165	-160	-155	-150	-145	-140	-135	-130	-125	-120	-115	-110	-105	-100	-95	-90	-85	-80	-75	-70	-65	-60	-55	-50	-45	-40	-35	-30	-25	-22	-21	-20	-19	-18	-17	-16	-15	-14	-13	-12	-11	-10	-9	-8	-7	-6	-5	-4	-3	-2	-1	0	1	2	3	4	5	6	7	8	9	10	11	12	13	14	15	16	17	18	19	20	21	22	25	30	35	40	45	50	55	60	65	70	75	80	85	90	95	100	105	110	115	120	125	130	135	140	145	150	155	160	165	170	175	180);



mutiRe_Cd
(
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.26	0.238	0.217	0.196	0.177	0.158	0.1405	0.123	0.0925	0.062	0.0343	0.0319	0.0297	0.0279	0.0264	0.0253	0.0243	0.0237	0.0233	0.0232	0.0233	0.0237	0.0243	0.0253	0.0264	0.0279	0.0297	0.0319	0.0343	0.062	0.0925	0.123	0.1405	0.158	0.177	0.196	0.217	0.238	0.26	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.26	0.238	0.217	0.196	0.177	0.158	0.1405	0.123	0.07	0.0297	0.0273	0.0252	0.0233	0.0217	0.0204	0.0194	0.0186	0.0181	0.0178	0.0177	0.0178	0.0181	0.0186	0.0194	0.0204	0.0217	0.0233	0.0252	0.0273	0.0297	0.07	0.123	0.1405	0.158	0.177	0.196	0.217	0.238	0.26	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.26	0.238	0.217	0.196	0.177	0.158	0.086	0.0292	0.0266	0.0243	0.0222	0.0204	0.0187	0.0174	0.0163	0.0155	0.0148	0.0143	0.014	0.0139	0.014	0.0143	0.0148	0.0155	0.0163	0.0174	0.0187	0.0204	0.0222	0.0243	0.0266	0.0292	0.086	0.158	0.177	0.196	0.217	0.238	0.26	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.26	0.238	0.217	0.196	0.104	0.0286	0.026	0.0237	0.0215	0.0195	0.0178	0.0163	0.0149	0.0138	0.0129	0.0122	0.0117	0.0113	0.0111	0.0111	0.0111	0.0113	0.0117	0.0122	0.0129	0.0138	0.0149	0.0163	0.0178	0.0195	0.0215	0.0237	0.026	0.0286	0.104	0.196	0.217	0.238	0.26	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.26	0.238	0.125	0.0295	0.0269	0.0244	0.0223	0.0202	0.0184	0.0166	0.0152	0.0138	0.0126	0.0117	0.0109	0.0103	0.0098	0.0096	0.0094	0.0094	0.0094	0.0096	0.0098	0.0103	0.0109	0.0117	0.0126	0.0138	0.0152	0.0166	0.0184	0.0202	0.0223	0.0244	0.0269	0.0295	0.125	0.238	0.26	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.2085	0.135	0.03	0.0273	0.0248	0.0226	0.0206	0.0187	0.017	0.0154	0.014	0.0128	0.0117	0.0108	0.0101	0.0096	0.0092	0.009	0.0089	0.0089	0.0089	0.009	0.0092	0.0096	0.0101	0.0108	0.0117	0.0128	0.014	0.0154	0.017	0.0187	0.0206	0.0226	0.0248	0.0273	0.03	0.135	0.2085	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.3055	0.282	0.145	0.0285	0.026	0.0236	0.0215	0.0196	0.0179	0.0162	0.0148	0.0135	0.0124	0.0114	0.0105	0.0098	0.0092	0.0089	0.0086	0.0084	0.0083	0.0082	0.0083	0.0084	0.0086	0.0089	0.0092	0.0098	0.0105	0.0114	0.0124	0.0135	0.0148	0.0162	0.0179	0.0196	0.0215	0.0236	0.026	0.0285	0.145	0.282	0.3055	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
(0.025	0.055	0.14	0.23	0.32	0.42	0.575	0.755	0.925	1.085	1.225	1.35	1.465	1.555	1.635	1.7	1.75	1.78	1.8	1.8	1.78	1.735	1.665	1.575	1.47	1.345	1.215	1.075	0.92	0.745	0.57	0.405	0.329	0.1792	0.0293	0.0268	0.0245	0.0224	0.0205	0.0186	0.017	0.0156	0.0143	0.0132	0.0121	0.0112	0.0104	0.0097	0.0091	0.0086	0.0083	0.0081	0.0079	0.0078	0.0078	0.0078	0.0079	0.0081	0.0083	0.0086	0.0091	0.0097	0.0104	0.0112	0.0121	0.0132	0.0143	0.0156	0.017	0.0186	0.0205	0.0224	0.0245	0.0268	0.0293	0.1792	0.329	0.405	0.57	0.745	0.92	1.075	1.215	1.345	1.47	1.575	1.665	1.735	1.78	1.8	1.8	1.78	1.75	1.7	1.635	1.555	1.465	1.35	1.225	1.085	0.925	0.755	0.575	0.42	0.32	0.23	0.14	0.055	0.025)
);


mutiRe_Cl
(
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-0.4802	-0.3345	-0.288	-0.2414	-0.2017	-0.1619	-0.13	-0.0981	-0.0907	-0.0833	-0.1247	-0.166	-0.2176	-0.2691	-0.3162	-0.342	-0.3427	-0.3382	-0.3086	-0.273	-0.2103	-0.1465	-0.0752	0	0.0752	0.1465	0.2103	0.273	0.3086	0.3382	0.3427	0.342	0.3162	0.2691	0.2176	0.166	0.1247	0.0833	0.0907	0.0981	0.13	0.1619	0.2017	0.2414	0.288	0.3345	0.4802	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-0.5297	-0.4091	-0.3783	-0.3475	-0.3348	-0.3221	-0.336	-0.3499	-0.3898	-0.4296	-0.4762	-0.5228	-0.5564	-0.578	-0.5874	-0.5751	-0.5445	-0.4953	-0.4324	-0.3564	-0.2731	-0.1839	-0.0921	0	0.0921	0.1839	0.2731	0.3564	0.4324	0.4953	0.5445	0.5751	0.5874	0.578	0.5564	0.5228	0.4762	0.4296	0.3898	0.3499	0.336	0.3221	0.3348	0.3475	0.3783	0.4091	0.5297	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-0.6664	-0.6023	-0.5972	-0.592	-0.6009	-0.6098	-0.6293	-0.6487	-0.674	-0.6993	-0.7255	-0.7363	-0.7443	-0.7374	-0.7148	-0.6745	-0.6209	-0.5486	-0.4687	-0.38	-0.2861	-0.1879	-0.0842	0	0.0842	0.1879	0.2861	0.38	0.4687	0.5486	0.6209	0.6745	0.7148	0.7374	0.7443	0.7363	0.7255	0.6993	0.674	0.6487	0.6293	0.6098	0.6009	0.592	0.5972	0.6023	0.6664	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-0.8866	-0.8453	-0.8425	-0.8397	-0.8443	-0.8489	-0.8603	-0.8717	-0.884	-0.8937	-0.8973	-0.8938	-0.8779	-0.85	-0.8026	-0.7434	-0.6728	-0.5891	-0.4998	-0.4044	-0.3024	-0.22	-0.11	0	0.11	0.22	0.3024	0.4044	0.4998	0.5891	0.6728	0.7434	0.8026	0.85	0.8779	0.8938	0.8973	0.8937	0.884	0.8717	0.8603	0.8489	0.8443	0.8397	0.8425	0.8453	0.8866	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-1.035	-0.994	-0.9899	-0.9858	-0.9885	-0.9911	-0.9973	-1.0056	-1.0106	-1.0122	-1.002	-0.9843	-0.9543	-0.9091	-0.8498	-0.7802	-0.6988	-0.61	-0.5146	-0.4128	-0.33	-0.22	-0.11	0	0.11	0.22	0.33	0.4128	0.5146	0.61	0.6988	0.7802	0.8498	0.9091	0.9543	0.9843	1.002	1.0122	1.0106	1.0056	0.9973	0.9911	0.9885	0.9858	0.9899	0.994	1.035	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-1.1018	-1.0644	-1.0599	-1.0554	-1.0571	-1.0588	-1.0641	-1.069	-1.0709	-1.0657	-1.0492	-1.0257	-0.9862	-0.9364	-0.8694	-0.7939	-0.7102	-0.6191	-0.5192	-0.44	-0.33	-0.22	-0.11	0	0.11	0.22	0.33	0.44	0.5192	0.6191	0.7102	0.7939	0.8694	0.9364	0.9862	1.0257	1.0492	1.0657	1.0709	1.069	1.0641	1.0588	1.0571	1.0554	1.0599	1.0644	1.1018	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-1.223	-1.1893	-1.1853	-1.1812	-1.1797	-1.1814	-1.1824	-1.1823	-1.1747	-1.158	-1.1305	-1.0906	-1.0398	-0.9739	-0.8986	-0.8143	-0.7254	-0.6268	-0.55	-0.44	-0.33	-0.22	-0.11	0	0.11	0.22	0.33	0.44	0.55	0.6268	0.7254	0.8143	0.8986	0.9739	1.0398	1.0906	1.1305	1.158	1.1747	1.1823	1.1824	1.1814	1.1797	1.1812	1.1853	1.1893	1.223	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
(0	0.66	0.85	0.68	0.635	0.67	0.77	0.9	0.98	0.93	0.85	0.76	0.67	0.575	0.45	0.32	0.185	0.05	-0.09	-0.23	-0.365	-0.5	-0.63	-0.76	-0.875	-0.955	-1.02	-1.05	-1.035	-0.98	-0.855	-1.3476	-1.313	-1.3092	-1.3054	-1.3066	-1.3031	-1.2977	-1.286	-1.268	-1.241	-1.1979	-1.1453	-1.0787	-1.0049	-0.9222	-0.8334	-0.7354	-0.66	-0.55	-0.44	-0.33	-0.22	-0.11	0	0.11	0.22	0.33	0.44	0.55	0.66	0.7354	0.8334	0.9222	1.0049	1.0787	1.1453	1.1979	1.241	1.268	1.286	1.2977	1.3031	1.3066	1.3054	1.3092	1.313	1.3476	0.855	0.98	1.035	1.05	1.02	0.955	0.875	0.76	0.63	0.5	0.365	0.23	0.09	-0.05	-0.185	-0.32	-0.45	-0.575	-0.67	-0.76	-0.85	-0.93	-0.98	-0.9	-0.77	-0.67	-0.635	-0.68	-0.85	-0.66	0)
);



// ************************************************************************* //
