case文件/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lower
    {
        type            zeroGradient;
    }
    upper
    {
        type            zeroGradient;
    }
    west
    {
        type            zeroGradient;

    }
    east
    {
        type            zeroGradient;

    }
    north
    {
        type            zeroGradient;

    }
    south
    {
       type            zeroGradient;

    }
}


// ************************************************************************* //
